%----------已知负载识别故障程度--------
clc
clear all
close all
%% 读入特征值
E0=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\备用EEMD特征值（自带）\正常数据');
E1=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\备用EEMD特征值（自带）\内圈故障');
E2=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\备用EEMD特征值（自带）\外圈故障');
E3=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\备用EEMD特征值（自带）\滚珠故障');
% E0=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\正常数据');
% E1=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\内圈故障');
% E2=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\外圈故障');
% E3=xlsread('E:\毕业课题\我的进展\课题的改进算法研究\EMD和改进EMD的分类结果对比\基于EEMD的特征提取\滚珠故障');
%% 训练数据和测试数据
HP=input('请输入负载（0-3代表0HP-3HP）:');
if HP==0
   type=input('请输入故障类型(1、内圈故障 2、外圈故障 3、滚珠故障):');    
   if type==1
       P_train=[E1(1:30,:);E1(193:222,:);E1(385:414,:);E1(577:606,:)]';
       P_test=[E1(31:48,:);E1(223:240,:);E1(415:432,:);E1(607:624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];   
   end
   if type==2
       P_train=[E2(1:30,:);E2(193:222,:);E2(385:414,:)]';
       P_test=[E2(31:48,:);E2(223:240,:);E2(415:432,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18)];     
   end
   if type==3
       P_train=[E3(1:30,:);E3(193:222,:);E3(385:414,:);E3(577:606,:)]';
       P_test=[E3(31:48,:);E3(223:240,:);E3(415:432,:);E3(607:624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];   
   end  
end
%% 
if HP==1
   type=input('请输入故障类型(1、内圈故障 2、外圈故障 3、滚珠故障):');    
   if type==1
       P_train=[E1(48+1:48+30,:);E1(48+193:48+222,:);E1(48+385:48+414,:);E1(48+577:48+606,:)]';
       P_test=[E1(48+31:48+48,:);E1(48+223:48+240,:);E1(48+415:48+432,:);E1(48+607:48+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];   
   end
   if type==2
       P_train=[E2(48+1:48+30,:);E2(48+193:48+222,:);E2(48+385:48+414,:)]';
       P_test=[E2(48+31:48+48,:);E2(48+223:48+240,:);E2(48+415:48+432,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18)];     
   end
   if type==3
       P_train=[E3(48+1:48+30,:);E3(48+193:48+222,:);E3(48+385:48+414,:);E3(48+577:48+606,:)]';
       P_test=[E3(48+31:48+48,:);E3(48+223:48+240,:);E3(48+415:48+432,:);E3(48+607:48+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];   
   end  
end
%% 
if HP==2
   type=input('请输入故障类型(1、内圈故障 2、外圈故障 3、滚珠故障):');    
   if type==1
       P_train=[E1(96+1:96+30,:);E1(96+193:96+222,:);E1(96+385:96+414,:);E1(96+577:96+606,:)]';
       P_test=[E1(96+31:96+48,:);E1(96+223:96+240,:);E1(96+415:96+432,:);E1(96+607:96+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];    
   end
   if type==2
       P_train=[E2(96+1:96+30,:);E2(96+193:96+222,:);E2(96+385:96+414,:)]';
       P_test=[E2(96+31:96+48,:);E2(96+223:96+240,:);E2(96+415:96+432,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18)];    
   end
   if type==3
       P_train=[E3(96+1:96+30,:);E3(96+193:96+222,:);E3(96+385:96+414,:);E3(96+577:96+606,:)]';
       P_test=[E3(96+31:96+48,:);E3(96+223:96+240,:);E3(96+415:96+432,:);E3(96+607:96+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];    
   end  
end
%%
if HP==3
   type=input('请输入故障类型(1、内圈故障 2、外圈故障 3、滚珠故障):');    
   if type==1
       P_train=[E1(144+1:144+30,:);E1(144+193:144+222,:);E1(144+385:144+414,:);E1(144+577:144+606,:)]';
       P_test=[E1(144+31:144+48,:);E1(144+223:144+240,:);E1(144+415:144+432,:);E1(144+607:144+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];    
   end
   if type==2
       P_train=[E2(144+1:144+30,:);E2(144+193:144+222,:);E2(144+385:144+414,:)]';
       P_test=[E2(144+31:144+48,:);E2(144+223:144+240,:);E2(144+415:144+432,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18)];     
   end
   if type==3
       P_train=[E3(144+1:144+30,:);E3(144+193:144+222,:);E3(144+385:144+414,:);E3(144+577:144+606,:)]';
       P_test=[E3(144+31:144+48,:);E3(144+223:144+240,:);E3(144+415:144+432,:);E3(144+607:144+624,:)]';
       T_train=[ones(1,30),2*ones(1,30),3*ones(1,30),4*ones(1,30)];
       T_test=[ones(1,18),2*ones(1,18),3*ones(1,18),4*ones(1,18)];   
   end  
end

%% PNN故障识别
t_train=ind2vec(T_train);%将输出转化为矢量
spread=0.007;
net=newpnn(P_train,t_train,spread);
%% 
y_train=sim(net,P_train);
y1=vec2ind(y_train);%训练输出，矢量转化为指针
figure
i=1:length(y1);
plot(i,y1,'o',i,T_train,'--k')
xlabel('训练样本')
ylabel('故障程度')
title('训练结果')
legend('模型训练分类结果','实际类别')

err1=length(y1)-length(find(y1-T_train==0));
disp(['负载为',num2str(HP),'，故障类型为',num2str(type),'时，训练数据识别失败个数为：',num2str(err1)]);
rate1=1-err1/length(y1);
disp(['负载为',num2str(HP),'，故障类型为',num2str(type),'时，训练数据识别成功率为：',num2str(rate1)]);
%% 测试
y_test=sim(net,P_test);
y2=vec2ind(y_test);
figure
i=1:length(y2);
plot(i,y2,'o',i,T_test,'--k')
xlabel('测试样本')
ylabel('故障程度')
title('测试结果')
legend('模型测试分类结果','实际类别')
err2=length(y2)-length(find(y2-T_test==0));
disp(['负载为',num2str(HP),'，故障类型为',num2str(type),'时，测试数据识别失败个数为：',num2str(err2)]);
rate2=1-err2/length(y2);
disp(['负载为',num2str(HP),'，故障类型为',num2str(type),'时，测试数据识别成功率为：',num2str(rate2)]);





